package com.edu.training.jc.repeatAlgoritm;

/**
 * Составить программу, вычисляющую значения функции до тех пор, пока не будет
 * пройден нуль функции. Значения аргумента x должны составлять возрастающую
 * арифметическую програссию с заданным начальным членом 0.1 и разностью 0.1.
 * Для того, чтобы не произошло зацикливания, установить предел изменения
 * аргумента x = 10.
 */

public class Task08 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
